contiki-os/contiki/cc26xxware/inc/hw_prcm.h
// Field: [3]    BUS
//
// Domain not designed for retention. Writing this bit will have no effect.
#define PRCM_PDRETEN_BUS                                            0x00000008
#define PRCM_PDRETEN_BUS_BITN                                       3
#define PRCM_PDRETEN_BUS_M                                          0x00000008
#define PRCM_PDRETEN_BUS_S                                          3

// Field: [1]    CPU
//
//
// 0: Retention disabled
// 1: Retention enabled
//
// Do not use!
// If disabled a subsequent cold reset of CPU power domain the boot code will
// error out and system CPU will be stuck
#define PRCM_PDRETEN_CPU                                            0x00000002
#define PRCM_PDRETEN_CPU_BITN                                       1
#define PRCM_PDRETEN_CPU_M                                          0x00000002
#define PRCM_PDRETEN_CPU_S                                          1

// Field: [0]    CLKCTL
//
// Domain not designed for retention. Writing this bit will have no effect.
#define PRCM_PDRETEN_CLKCTL                                         0x00000001
#define PRCM_PDRETEN_CLKCTL_BITN                                    0
#define PRCM_PDRETEN_CLKCTL_M                                       0x00000001
#define PRCM_PDRETEN_CLKCTL_S                                       0

//*****************************************************************************
//
// Register: PRCM_O_RAMHWOPT
//
//*****************************************************************************
// Field: [1:0] SIZE
//
// Only writeable when PRCMHWOPT.LOCK = 0
//
// For changes to take effect, CLKLOADCTL.LOAD needs to be written
// ENUMs:
// 4K                   Select 4k RAMSIZE
// 10K                  Select 10k RAMSIZE
// 16K                  Select 16k RAMSIZE
// 20K                  Select 20k RAMSIZE
//
#define PRCM_RAMHWOPT_SIZE_M                                        0x00000003
#define PRCM_RAMHWOPT_SIZE_S                                        0
#define PRCM_RAMHWOPT_SIZE_4K                                       0x00000000
#define PRCM_RAMHWOPT_SIZE_10K                                      0x00000001
#define PRCM_RAMHWOPT_SIZE_16K                                      0x00000002
#define PRCM_RAMHWOPT_SIZE_20K                                      0x00000003

#endif // __HW_PRCM_H__
